---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.Dispose
source: html/32cea3d7-c725-85c6-5a30-39e12dffc137.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.Dispose Method

Releases all resources used by the ZoneEquipmentData

## Syntax (C#)
```csharp
public void Dispose()
```